#!/usr/bin/env bash

# Taps
tap 'homebrew/core'
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-versions'
tap 'homebrew/cask-drivers'
tap 'buo/cask-upgrade'

# Binaries
brew 'coreutils'
brew 'curl'
brew 'git'
brew 'git-flow'
brew 'gnupg'
brew 'grep'
brew 'httpie'
brew 'mackup'
brew 'mas'
brew 'readline'
brew 'openssl'
brew 'php'
brew 'trash'
brew 'tree'
brew 'wget'
brew 'zsh'

# Apps
cask '1password'
cask 'aerial'
cask 'alfred'
# cask 'amethyst'
cask 'bartender'
cask 'cleanmymac'
cask 'choosy'
cask 'cryptomator'
cask 'dash'
cask 'evernote'
cask 'firefox'
cask 'firefox-developer-edition'
cask 'flux'
# cask 'gpg-suite'
cask 'imageoptim'
cask 'insomnia'
cask 'iconjar'
cask 'iterm2'
cask 'jaxx-liberty'
cask 'jetbrains-toolbox'
cask 'keepingyouawake' 
cask 'liteicon'
cask 'logitech-options'
cask 'neofinder'
cask 'nightowl'
cask 'nordvpn'
cask 'notion'
cask 'protonmail-bridge'
cask 'raindropio'
cask 'recordit'
cask 'sequel-pro'
cask 'signal'
cask 'sketch'
cask 'soundmate'
cask 'spotify'
cask 'sync'
cask 'transmission'
cask 'vagrant'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'visual-studio-code'
cask 'vlc'
cask 'wavebox'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Drivers
cask 'canon-imagerunner-printer-driver-ufrii' # UZH Printer

# Fonts

# Mac App Store
mas 'Clear', id: 504544917
mas 'Xcode', id: 497799835
mas 'Magnet', id: 441258766
mas 'Keynote', id: 409183694
mas 'Type Fu', id: 509818877
mas 'UlyssesMac', id: 1225570693
mas 'iA Writer', id: 775737590
mas 'Bear', id: 1091189122
mas 'Pocket', id: 568494494
mas 'Pages', id: 409201541
mas 'SoundMate', id: 675025930
mas 'LittleIpsum', id: 405772121
mas 'LINE', id: 539883307
mas 'Numbers', id: 409203825
mas 'The Clock', id: 488764545