#!/usr/bin/env bash

# Taps
tap 'buo/cask-upgrade'
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-drivers'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/core'
tap 'homebrew/services'

# Binaries
brew 'bluetoothconnector'
brew 'coreutils'
brew 'curl'
brew 'ffmpeg'
brew 'git'
brew 'git-lfs'
brew 'github/gh/gh'
brew 'gnupg'
brew 'grep'
brew 'htop'
brew 'httpie'
brew 'lsd'
brew 'n'
brew 'mackup'
brew 'mas'
brew 'openssl'
brew 'tig'
brew 'tree'
#brew 'starship'
brew 'wget'
brew 'youtube-dl'
brew 'zsh'
brew 'zsh-syntax-highlighting'

# Apps
cask '1password'
# cask 'aerial'
cask 'adobe-creative-cloud'
cask 'alfred'
cask 'airbar'
cask 'atext'
cask 'backblaze'
cask 'bartender'
cask 'basecamp'
cask 'carbon-copy-cloner'
cask 'cleanmymac'
cask 'choosy'
cask 'cryptomator'
cask 'dash'
# cask 'deckset'
cask 'evernote'
cask 'firefox'
cask 'firefox-developer-edition'
#cask 'flux'
cask 'gitfox'
cask 'google-chrome'
cask 'gpg-suite'
cask 'hazel'
cask 'insomnia'
cask 'iconjar'
cask 'iterm2'
cask 'jaxx-liberty'
cask 'jetbrains-toolbox'
cask 'liteicon'
cask 'logitech-options'
cask 'mountain-duck'
cask 'neofinder'
# cask 'nightowl'
# cask 'noizio'
cask 'notion'
cask 'numi'
cask 'optimage'
cask 'raindropio'
cask 'recordit'
cask 'secretive'
cask 'selfcontrol'
cask 'shifty'
cask 'signal'
cask 'sketch'
cask 'soundcleod'
cask 'spotify'
cask 'sync'
cask 'tableplus'
cask 'telegram'
#cask 'the-unarchiver'
cask 'transmission'
cask 'transmit'
#cask 'tripmode'
cask 'vagrant'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'visual-studio-code'
cask 'vlc'
cask 'wavebox'
cask 'zotero'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'
cask 'qlimagesize'
cask 'suspicious-package'
cask 'quicklookase'
cask 'qlvideo'

# Printer
# cask 'canon-imagerunner-printer-driver-ufrii'

# Fonts
cask 'font-fira-code'
cask 'font-fira-mono'
cask 'font-fira-sans'
cask 'font-firacode-nerd-font'
cask 'font-firacode-nerd-font-mono'
cask 'font-hack'
cask 'font-hack-nerd-font'
cask 'font-ia-writer-duo'
cask 'font-ia-writer-duospace'
cask 'font-ia-writer-mono'
cask 'font-ia-writer-quattro'
cask 'font-jetbrains-mono'
cask 'font-jetbrainsmono-nerd-font'
cask 'font-jetbrainsmono-nerd-font-mono'
cask 'font-lato'
cask 'font-playfair-display'
cask 'font-public-sans'
cask 'font-roboto'

# Mac App Store
mas '1Blocker', id: 1107421413
mas 'Amphetamine', id: 937984704
mas 'Bear', id: 1091189122
mas 'Endel', id: 1484348796
mas 'iA Writer', id: 775737590
mas 'Keynote', id: 409183694
mas 'LINE', id: 539883307
mas 'LittleIpsum', id: 405772121
mas 'Magnet', id: 441258766
# mas 'Name Mangler', id: 603637384
mas 'NextDNS', id: 1464122853
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Pocket', id: 568494494
mas 'Raindrop.io for Safari', id: 957810159
mas 'Save to Pocket', id: 1477385213
mas 'SiteSucker', id: 442168834
# mas 'Tadama', id: 1415817706
mas 'The Clock', id: 488764545
mas 'Type Fu', id: 509818877
mas 'Ulysses', id: 1225570693
mas 'Xcode', id: 497799835
