#!/usr/bin/env bash

# Taps
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-versions'
tap 'homebrew/cask-fonts'
tap 'homebrew/services'

# Binaries
brew 'bluetoothconnector'
brew 'coreutils'
brew 'curl'
brew 'ffmpeg'
brew 'fish'
brew 'git'
brew 'git-delta'
brew 'git-lfs'
brew 'gh'
brew 'gitui'
brew 'gnupg'
brew 'grep'
brew 'htop'
brew 'httpie'
# brew 'lsd'
brew 'n'
brew 'mackup'
brew 'mas'
# brew 'mysql-client'
brew 'openssl'
brew 'php'
brew 'pinentry'
brew 'supervisor'
brew 'svn'
brew 'tig'
brew 'trash'
brew 'tree'
brew 'wget'

# Apps
cask '1password'
# cask 'adobe-creative-cloud'
# cask 'aldente-pro'
cask 'backblaze'
# cask 'bartender'
cask 'betterdisplay'
# cask 'bunch'
# cask 'carbon-copy-cloner'
cask 'cleanmymac'
# cask 'cryptomator'
# cask 'dash'
cask 'dbngin'
cask 'dictcc-en-de-dictionary-plugin'
# cask 'discord'
# cask 'deckset'
cask 'figma'
cask 'firefox'
cask 'firefox-developer-edition'
# cask 'gitfox'
cask 'google-chrome'
cask 'gpg-suite'
cask 'hazel'
cask 'herd'
# cask 'iterm2'
cask 'jetbrains-toolbox'
cask 'karabiner-elements'
# cask 'logi-options-plus'
# cask 'loom'
cask 'mac-mouse-fix'
# cask 'microsoft-teams'
# cask 'monitorcontrol'
cask 'mos'
cask 'mountain-duck'
# cask 'neofinder'
cask 'notion'
cask 'numi'
cask 'obsidian'
cask 'optimage'
# cask 'pixelsnap'
cask 'protonvpn'
cask 'ray'
cask 'raycast'
# cask 'recordit'
cask 'safari-technology-preview'
cask 'selfcontrol'
cask 'setapp'
cask 'shifty'
cask 'signal'
cask 'spotify'
cask 'sync'
cask 'tableplus'
cask 'telegram'
cask 'tinkerwell'
cask 'tower'
cask 'transmission'
cask 'transmit'
cask 'visual-studio-code'
# cask 'vlc'
cask 'warp'
cask 'wavebox'
# cask 'zoom'
cask 'zotero'

# Fonts
cask 'font-fira-code'
cask 'font-fira-mono'
cask 'font-fira-sans'
cask 'font-hack'
# cask 'font-jetbrains-mono'
cask 'font-public-sans'

cask 'font-playfair-display'
cask 'font-lato'
cask 'font-dm-sans'

# cask 'font-ia-writer-duo'
# cask 'font-ia-writer-duospace'
# cask 'font-ia-writer-mono'
# cask 'font-ia-writer-quattro'

# Mac App Store
mas '1Password for Safari', id: 1569813296
mas 'Amphetamine', id: 937984704
# mas 'Aspen', id: 6475777033
mas 'Baking Soda', id: 1601151613
mas 'Bookmarks', id: 1503569422
mas 'Bike', id: 1588292384
mas 'Color Picker', id: 1545870783
mas 'Command X', id: 6448461551
mas 'Cookie', id: 6452017315
mas 'DaftCloud', id: 1320450034
mas 'DevCleaner', id: 1388020431
mas 'EasyLetter', id: 1495179755
mas 'Endel', id: 1346247457
# mas 'Final Cut Pro', id: 424389933
mas 'Gestimer', id: 6447125648
# mas 'Gifski', id: 1351639930
mas 'Harvest', id: 506189836
# mas 'Hue Menu Bar', id: 1500678169
mas 'Hush', id: 1544743900
mas 'iA Writer', id: 775737590
mas 'Infuse', id: 1136220934
# mas 'Jiffy', id: 1502527999
mas 'Kagi Search', id: 1622835804
mas 'Keynote', id: 409183694
mas 'LINE', id: 539883307
mas 'Little Snitch Mini', id: 1629008763
mas 'Magnet', id: 441258766
mas 'Mela', id: 1568924476
mas 'Microsoft Excel', id: 462058435
mas 'Microsoft Word', id: 462054704
mas 'Micro Snitch', id: 972028355
mas 'Muse', id: 1501563902
# mas 'Name Mangler', id: 603637384
mas 'NextDNS', id: 1464122853
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Pandan', id: 1569600264
# mas 'PDFify', id: 1435055351
mas 'Peek', id: 1554235898
mas 'Pixelmator Pro', id: 1289583905
# mas 'Photomator', id: 1444636541
# mas 'Poolsuite FM', id: 1514817810
# mas 'Pomy', id: 1422640635
mas 'Pure Paste', id: 1611378436
mas 'Reeder', id: 1529448980
mas 'reMarkable', id: 1276493162
mas 'Save to Pocket', id: 1477385213
mas 'SiteSucker', id: 442168834
mas 'Slack', id: 803453959
mas 'Speediness', id: 1596706466
mas 'Tailscale', id: 1475387142
mas 'Tampermonkey', id: 1482490089
mas 'TestFlight', id: 899247664
mas 'The Clock', id: 488764545
mas 'Things', id: 904280696
# mas 'ToothFairy', id: 1191449274
mas 'Velja', id: 1607635845
mas 'Week Number', id: 6502579523
# mas 'WiFi Explorer', id: 494803304
mas 'Wipr', id: 1320666476
mas 'Vinegar', id: 1591303229
mas 'Xcode', id: 497799835
mas 'Yubico Authenticator', id: 1497506650
