jorgebucaran/fisher
jethrokuan/z
jethrokuan/fzf
adriaanzon/fish-artisan-completion
shinriyo/breeze
pure-fish/pure
kenchou/fish-plugin-pj
jhillyerd/plugin-git
